ORGWEBPAGE/faq.org

#+STARTUP:   overview align
#+TYP_TODO:  TODO IDEA WISH QUESTION DECLINED INCONSISTENCY BUG DONE
#+OPTIONS:   H:2 num:t toc:t \n:nil @:t ::t |:t ^:t *:t TeX:t
#+EMAIL:     carsten.dominik@gmail.com
#+TITLE:     Org-mode Frequently Asked Questions

* General
** Use features in other modes
 *I would like to use editing features of org-mode in other modes, is
 this possible?* 

Not really.  For tables there is =orgtbl-mode= which implements the
table editor as a minor mode.  For other features you need to switch to
Org-mode temporarily, or prepare text in a different buffer.


** Visibility cycling in Outline-mode and Outline-minor-mode

 *Can I get the visibility-cycling features in outline-mode and
outline-minor-mode?* 

   Yes, these functions are written in a way that they are independent of
   the outline setup.  The following setup provides standard Org-mode
   functionality in outline-mode on =TAB= and =S-TAB=.  For
   outline-minor-mode, we use =C-TAB= instead of =TAB=,
   because =TAB= usually has mode-specific tasks.

:(add-hook 'outline-minor-mode-hook
:  (lambda ()
:    (define-key outline-minor-mode-map [(control tab)] 'org-cycle)
:    (define-key outline-minor-mode-map [(shift tab)] 'org-global-cycle)))
:(add-hook 'outline-mode-hook
:  (lambda ()
:    (define-key outline-mode-map [(tab)] 'org-cycle)
:    (define-key outline-mode-map [(shift tab)] 'org-global-cycle)))

Or check out /outline-magic.el/, which does this and also provides
promotion and demotion functionality.  /outline-magic.el/ is
available at [[http://www.astro.uva.nl/~dominik/Tools/OutlineMagic][Outline Magic]].

* Errors
** =(wrong-type-argument keymapp nil)=
 *When I try to use Org-mode, I always get the error message
@code{(wrong-type-argument keymapp nil)}*

This is a conflict with an outdated version of the /allout.el/, see
the [[http://staff.science.uva.nl/~dominik/Tools/org/org.html#Conflicts][Conflicts]] section in the manual

** CUA mode does not work with Org-mode

 *Org-mode takes over the S-cursor keys.  I also want to use CUA-mode,
is there a way to fix this conflict?*

Yes, see the  [[http://staff.science.uva.nl/~dominik/Tools/org/org.html#Conflicts][Conflicts]] section of the manual.

** =winddmove.el= does not work with Org-mode.

 *Org-mode takes over the S-cursor keys.  I also want to use windmove.el,
is there a way to fix this conflict?*

Yes, see the [[http://staff.science.uva.nl/~dominik/Tools/org/org.html#Conflicts][Conflicts]] section of the manual.

* Setup and Structure
** Org-mode as default mode

 *Org-mode seems to be a useful default mode for the various README
files I have scattered through my directories*.  *How do I turn it on
for all README files?*

Add the following to your .emacs file:

: (add-to-list 'auto-mode-alist '("README$" . org-mode))

You can even make it the default mode for any files with unspecified
mode using

: (setq default-major-mode 'org-mode)

** Get rid of extra stars in outline

 *All these stars are driving me mad, I just find the Emacs outlines
unreadable.  Can't you just put white space and a single star as a
starter for headlines?* 

See the section  [[http://staff.science.uva.nl/~dominik/Tools/org/org.html#Clean%20outline%20view][Clean outline view]] in the manual.

** Two windows on same Org-mode file
 *I would like to have two windows on the same Org-mode file, but with
different outline visibility.  Is that possible?* 

You may use /indirect buffers/ which do exactly this.  See the
documentation on the command =make-indirect-buffer=.

** Insert empty lines before new headings and plain list items

 *I would like to have an empty line before each newly inserted
headline, but not before each newly inserted plain-list item*.

: (setq org-blank-before-new-entry
:       '((heading . t) (plain-list-item . nil))


** Amount of context in sparse trees

   *Sparse tree show the headline hierarchy above each match, and also
   the headline following a match.  I'd like to construct more compact
   trees, with less context.*

Take a look at the variables =org-show-hierarchy-above= and
=org-show-following-headline=.

** Stacking calls to org-occur

 *Each call to org-occur starts again from OVERVIEW and exposes only
 the matches of the current call.  I'd like to combine the effect of
 several calls*.

You can construct a regular expression that matches all targets you
want.  Alternatively, use a =C-u= prefix with the second and any
further calls to =org-occur= to keep the current visibility and
highlighting in addition to the new ones.

* Hyperlinks

** Confirmation for shell and elisp links

 *When I am executing shell/elisp links I always get a confirmation
prompt and need to type "yes RET", that's 4 key presses!  Can I get
rid of this?* 

The confirmation is there to protect you from unwantingly execute
potentially dangerous commands.  For example, imagine a link
:[[shell:rm -rf ~/*][ Google Search]]

In an Org-mode buffer, this command would look like /Google Search/,
but really it would remove your home directory.  If you wish, you can
make it easier to respond to the query by setting

: (setq org-confirm-shell-link-function 'y-or-n-p
:       org-confirm-elisp-link-function 'y-or-n-p).

Then a single keypress will be enough to confirm those links.  It is
also possible to turn off this check entirely, but I strongly recommend
against this.  Be warned.

** Use RET or TAB to follow a link

 *From other packages like Emacs-wiki, I am used to follow links with
 =RET= when the cursor is on the link.  Is this also possible in org-mode?*

Yes, and you may also use TAB.

: (setq org-return-follows-link t)
: (setq org-tab-follows-link t)

