ORGWEBPAGE/tmp/faq.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Org-mode Frequently Asked Questions</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2008/01/27 10:12:10"/>
<meta name="author" content="Carsten Dominik"/>
<link rel=stylesheet href="freeshell2.css" type="text/css">
</head><body>
<h1 class="title">Org-mode Frequently Asked Questions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<ul>
<li><a href="#sec-1">1 General</a>
<ul>
<li><a href="#sec-2">1.1 Use features in other modes</a></li>
<li><a href="#sec-3">1.2 Visibility cycling in Outline-mode and Outline-minor-mode</a></li>
</ul>
</li>
<li><a href="#sec-4">2 Errors</a>
<ul>
<li><a href="#sec-5">2.1 <code>(wrong-type-argument keymapp nil)</code></a></li>
<li><a href="#sec-6">2.2 CUA mode does not work with Org-mode</a></li>
<li><a href="#sec-7">2.3 <code>winddmove.el</code> does not work with Org-mode.</a></li>
</ul>
</li>
<li><a href="#sec-8">3 Setup and Structure</a>
<ul>
<li><a href="#sec-9">3.1 Org-mode as default mode</a></li>
<li><a href="#sec-10">3.2 Get rid of extra stars in outline</a></li>
<li><a href="#sec-11">3.3 Two windows on same Org-mode file</a></li>
<li><a href="#sec-12">3.4 Insert empty lines before new headings and plain list items</a></li>
<li><a href="#sec-13">3.5 Amount of context in sparse trees</a></li>
<li><a href="#sec-14">3.6 Stacking calls to org-occur</a></li>
</ul>
</li>
<li><a href="#sec-15">4 Hyperlinks</a>
<ul>
<li><a href="#sec-16">4.1 Confirmation for shell and elisp links</a></li>
<li><a href="#sec-17">4.2 Use RET or TAB to follow a link</a></li>
<li><a href="#sec-18">4.3 Clicking on a link without activating it</a></li>
</ul>
</li>
<li><a href="#sec-19">5 Remember</a></li>
<li><a href="#sec-20">6 Export</a>
<ul>
<li><a href="#sec-21">6.1 Make TODO entries items, not headlines in HTML export</a></li>
<li><a href="#sec-22">6.2 Export only a subtree</a></li>
<li><a href="#sec-23">6.3 How to import org-mode calendar data into Mac OSX ical</a></li>
</ul>
</li>
<li><a href="#sec-24">7 Tables</a>
<ul>
<li><a href="#sec-25">7.1 #ERROR fields in tables</a></li>
<li><a href="#sec-26">7.2 Unwanted new lines in table</a></li>
<li><a href="#sec-27">7.3 Automatic detection of formulas</a></li>
<li><a href="#sec-28">7.4 Change indentation of a table</a></li>
<li><a href="#sec-29">7.5 Performance issues with table alignment</a></li>
<li><a href="#sec-30">7.6 Performance issues with table calculation</a></li>
<li><a href="#sec-31">7.7 Incrementing numbers</a></li>
</ul>
</li>
<li><a href="#sec-32">8 Agenda</a>
<ul>
<li><a href="#sec-33">8.1 Include Org-mode agenda into Emacs diary</a></li>
</ul>
</li>
</ul>
</div>

<div class="outline-2">
<h2 id="sec-1">1 General</h2>


<div class="outline-3">
<h3 id="sec-2">1.1 Use features in other modes</h3>

<p><b>I would like to use editing features of org-mode in other modes, is  this possible?</b> 
</p>
<p>
Not really.  For tables there is <code>orgtbl-mode</code> which implements the
table editor as a minor mode.  For other features you need to switch to
Org-mode temporarily, or prepare text in a different buffer.
</p>

</div>

<div class="outline-3">
<h3 id="sec-3">1.2 Visibility cycling in Outline-mode and Outline-minor-mode</h3>


<p>
<b>Can I get the visibility-cycling features in outline-mode and outline-minor-mode?</b> 
</p>
<p>
Yes, these functions are written in a way that they are independent of
the outline setup.  The following setup provides standard Org-mode
functionality in outline-mode on <code>TAB</code> and <code>S-TAB</code>.  For
outline-minor-mode, we use <code>C-TAB</code> instead of <code>TAB</code>,
because <code>TAB</code> usually has mode-specific tasks.
</p>
<p>
<pre>
(add-hook 'outline-minor-mode-hook
  (lambda ()
    (define-key outline-minor-mode-map [(control tab)] 'org-cycle)
    (define-key outline-minor-mode-map [(shift tab)] 'org-global-cycle)))
(add-hook 'outline-mode-hook
  (lambda ()
    (define-key outline-mode-map [(tab)] 'org-cycle)
    (define-key outline-mode-map [(shift tab)] 'org-global-cycle)))
</pre>
</p>
<p>
Or check out <i>outline-magic.el</i>, which does this and also provides
promotion and demotion functionality.  <i>outline-magic.el</i> is
available at <a href="http://www.astro.uva.nl/~dominik/Tools/OutlineMagic">Outline Magic</a>.
</p>
</div>
</div>

<div class="outline-2">
<h2 id="sec-4">2 Errors</h2>


<div class="outline-3">
<h3 id="sec-5">2.1 <code>(wrong-type-argument keymapp nil)</code></h3>

<p><b>When I try to use Org-mode, I always get the error message @code{(wrong-type-argument keymapp nil)}</b>
</p>
<p>
This is a conflict with an outdated version of the <i>allout.el</i>, see
the <a href="http://staff.science.uva.nl/~dominik/Tools/org/org.html#Conflicts">Conflicts</a> section in the manual
</p>
</div>

<div class="outline-3">
<h3 id="sec-6">2.2 CUA mode does not work with Org-mode</h3>


<p>
<b>Org-mode takes over the S-cursor keys.  I also want to use CUA-mode, is there a way to fix this conflict?</b>
</p>
<p>
Yes, see the  <a href="http://staff.science.uva.nl/~dominik/Tools/org/org.html#Conflicts">Conflicts</a> section of the manual.
</p>
</div>

<div class="outline-3">
<h3 id="sec-7">2.3 <code>winddmove.el</code> does not work with Org-mode.</h3>


<p>
<b>Org-mode takes over the S-cursor keys.  I also want to use windmove.el, is there a way to fix this conflict?</b>
</p>
<p>
Yes, see the <a href="http://staff.science.uva.nl/~dominik/Tools/org/org.html#Conflicts">Conflicts</a> section of the manual.
</p>
</div>
</div>

<div class="outline-2">
<h2 id="sec-8">3 Setup and Structure</h2>


<div class="outline-3">
<h3 id="sec-9">3.1 Org-mode as default mode</h3>


<p>
<b>Org-mode seems to be a useful default mode for the various README files I have scattered through my directories</b>.  <b>How do I turn it on for all README files?</b>
</p>
<p>
Add the following to your .emacs file:
</p>
<p>
<pre>
 (add-to-list 'auto-mode-alist '("README$" . org-mode))
</pre>
</p>
<p>
You can even make it the default mode for any files with unspecified
mode using
</p>
<p>
<pre>
 (setq default-major-mode 'org-mode)
</pre>
</p>
</div>

<div class="outline-3">
<h3 id="sec-10">3.2 Get rid of extra stars in outline</h3>


<p>
*All these stars are driving me mad, I just find the Emacs outlines
unreadable.  Can't you just put white space and a single star as a
starter for headlines?* 
</p>
<p>
See the section  <a href="http://staff.science.uva.nl/~dominik/Tools/org/org.html#Clean%20outline%20view">Clean outline view</a> in the manual.
</p>
</div>

<div class="outline-3">
<h3 id="sec-11">3.3 Two windows on same Org-mode file</h3>

<p><b>I would like to have two windows on the same Org-mode file, but with different outline visibility.  Is that possible?</b> 
</p>
<p>
You may use <i>indirect buffers</i> which do exactly this.  See the
documentation on the command <code>make-indirect-buffer</code>.
</p>
</div>

<div class="outline-3">
<h3 id="sec-12">3.4 Insert empty lines before new headings and plain list items</h3>


<p>
<b>I would like to have an empty line before each newly inserted headline, but not before each newly inserted plain-list item</b>.
</p>
<p>
<pre>
 (setq org-blank-before-new-entry
       '((heading . t) (plain-list-item . nil))
</pre>
</p>

</div>

<div class="outline-3">
<h3 id="sec-13">3.5 Amount of context in sparse trees</h3>


<p>
*Sparse tree show the headline hierarchy above each match, and also
the headline following a match.  I'd like to construct more compact
trees, with less context.*
</p>
<p>
Take a look at the variables <code>org-show-hierarchy-above</code> and
<code>org-show-following-headline</code>.
</p>
</div>

<div class="outline-3">
<h3 id="sec-14">3.6 Stacking calls to org-occur</h3>


<p>
*Each call to org-occur starts again from OVERVIEW and exposes only
the matches of the current call.  I'd like to combine the effect of
several calls*.
</p>
<p>
You can construct a regular expression that matches all targets you
want.  Alternatively, use a <code>C-u</code> prefix with the second and any
further calls to <code>org-occur</code> to keep the current visibility and
highlighting in addition to the new ones.
</p>
</div>
</div>

<div class="outline-2">
<h2 id="sec-15">4 Hyperlinks</h2>



<div class="outline-3">
<h3 id="sec-16">4.1 Confirmation for shell and elisp links</h3>


<p>
*When I am executing shell/elisp links I always get a confirmation
prompt and need to type "yes RET", that's 4 key presses!  Can I get
rid of this?* 
</p>
<p>
The confirmation is there to protect you from unwantingly execute
potentially dangerous commands.  For example, imagine a link
<pre>
[[shell:rm -rf ~/*][ Google Search]]
</pre>
</p>
<p>
In an Org-mode buffer, this command would look like <i>Google Search</i>,
but really it would remove your home directory.  If you wish, you can
make it easier to respond to the query by setting
</p>
<p>
<pre>
 (setq org-confirm-shell-link-function 'y-or-n-p
       org-confirm-elisp-link-function 'y-or-n-p).
</pre>
</p>
<p>
Then a single keypress will be enough to confirm those links.  It is
also possible to turn off this check entirely, but I strongly recommend
against this.  Be warned.
</p>
</div>

<div class="outline-3">
<h3 id="sec-17">4.2 Use RET or TAB to follow a link</h3>


<p>
<b>From other packages like Emacs-wiki, I am used to follow links with  =RET= when the cursor is on the link.  Is this also possible in org-mode?</b>
</p>
<p>
Yes, and you may also use TAB.
</p>
<p>
<pre>
 (setq org-return-follows-link t)
 (setq org-tab-follows-link t)
</pre>
</p>
</div>
