ORGWEBPAGE/tmp/faq.html

<div class="outline-3">
<h3 id="sec-18">4.3 Clicking on a link without activating it</h3>


<p>
<b>Each time I click inside a link in order to set point to this  location, Org-mode actually follows the link</b>
</p>
<p>
Activating links with <code>mouse-1</code> is a new feature in Emacs 22, to make
link behavior similar to other applications like web browsers.  If you
hold the mouse button down a bit longer, the cursor will be set
without following the link.  If you cannot get used to this behavior,
you can (as in Emacs 21) use <code>mouse-2</code> to follow links and turn off
link activation for <code>mouse-1</code> with
</p>
<p>
<pre>
 (setq org-mouse-1-follows-link nil)
</pre>
</p>
</div>
</div>

<div class="outline-2">
<h2 id="sec-19">5 Remember</h2>


<p>
<b>Can I automatically start the clock when opening a remember template?</b>
</p>
<p>
Yes, this is possible.  Use the following code and make sure that
after executing it, `my-start-clock-if-needed' is in
`remember-mode-hook' <i>after</i> `org-remember-apply-template'.
</p>
<p>
<pre>
 (add-hook 'remember-mode-hook 'my-start-clock-if-needed 'append)
 (defun my-start-clock-if-needed ()
   (save-excursion
     (goto-char (point-min))
     (when (re-search-forward " *CLOCK-IN *" nil t)
       (replace-match "")
       (org-clock-in))))
</pre>
</p>
<p>
Then, when a template contains the key string CLOCK-IN, the clock will
be started.  Starting with Org-mode version 5.20, the clock will
automatically be stopped when storing the remember buffer.
</p>
</div>

<div class="outline-2">
<h2 id="sec-20">6 Export</h2>


<div class="outline-3">
<h3 id="sec-21">6.1 Make TODO entries items, not headlines in HTML export</h3>


<p>
*When I export my TODO list, every TODO item becomes a separate
section.  How do I enforce these items to be exported as an itemized
list?* 
</p>
<p>
If you plan to use ASCII or HTML export, make sure things you want to
be exported as item lists are level 4 at least, even if that does mean
there is a level jump.  For example:
</p>
<p>
<pre>
 * Todays top priorities
 **** TODO write a letter to xyz
 **** TODO Finish the paper
 **** Pick up kids at the school
</pre>
</p>
<p>
Alternatively, if you need a specific value for the heading/item
transition in a particular file, use the <code>#+OPTIONS</code> line to
configure the H switch.
</p>
<p>
<pre>
 #+OPTIONS:   H:2; ...
</pre>
</p>
</div>

<div class="outline-3">
<h3 id="sec-22">6.2 Export only a subtree</h3>


<p>
<b>I would like to export only a subtree of my file to HTML. How?</b>
</p>
<p>
If you want to export a subtree, mark the subtree as region and then
export.  Marking can be done with <code>C-c @ C-x C-x</code>, for example.
</p>
</div>

<div class="outline-3">
<h3 id="sec-23">6.3 How to import org-mode calendar data into Mac OSX ical</h3>


<p>
<b>I would like my iCal program on Mac OSX to import the iCalendar file   produced by Org-mode. How?</b>
</p>
<p>
<i>This is for OSX 10.3, see below for 10.4:</i> When using iCal under
Apple MacOS X, you can create a new calendar <i>OrgMode</i> (the default
name for the calendar created by <code>C-c C-e c</code>, see the variables
<code>org-icalendar-combined-name</code> and
<code>org-combined-agenda-icalendar-file</code>).  Then set Org-mode to overwrite
the corresponding file <i>~/Library/Calendars/OrgMode.ics</i>.  You may
even use AppleScript to make iCal re-read the calendar files each time
a new version of <i>OrgMode.ics</i> is produced.  Here is the setup needed
for this:
</p>
<p>
<pre>
 (setq org-combined-agenda-icalendar-file
     "~/Library/Calendars/OrgMode.ics")
 (add-hook 'org-after-save-iCalendar-file-hook
  (lambda ()
   (shell-command
    "osascript -e 'tell application \"iCal\" to reload calendars'")))
</pre>
</p>

<p>
For Mac OS X 10.4, you need to write the ics file to
<code>/Library/WebServer/Documents/</code> and then subscribe iCalendar to
<code>http: //localhost/orgmode.ics</code>
</p>
</div>
</div>

<div class="outline-2">
<h2 id="sec-24">7 Tables</h2>


<div class="outline-3">
<h3 id="sec-25">7.1 #ERROR fields in tables</h3>


<p>
<b>One of my table columns has started to fill up with =#ERROR=.  What is going on?</b>
</p>
<p>
Org-mode tried to compute the column from other fields using a
formula stored in the <code>#+TBLFM:</code> line just below the table, and
the evaluation of the formula fails.  Fix the fields used in the
formula, or fix the formula, or remove it!
</p>
</div>

<div class="outline-3">
<h3 id="sec-26">7.2 Unwanted new lines in table</h3>


<p>
*When I am in the last column of a table and just above a horizontal
line in the table, pressing TAB creates a new table line before the
horizontal line*.  <b>How can I quickly move to the line below the horizontal line instead?</b> 
</p>
<p>
Press <code>down</code> (to get on the separator line) and then <code>TAB</code>.
Or configure the variable
</p>
<p>
<pre>
 (setq org-table-tab-jumps-over-hlines t)
</pre>
</p>
</div>

<div class="outline-3">
<h3 id="sec-27">7.3 Automatic detection of formulas</h3>

<p><b>I need to use fields in my table that start with "=", and each time  I enter such a field, Org-mode thinks this is a formula</b>.
</p>
<p>
With the setting
</p>
<p>
<pre>
 (setq org-table-formula-evaluate-inline nil)
</pre>
</p>
<p>
this will no longer happen.  You can still use formulas using the
commands <tt>C-c =</tt> and <tt>C-u C-c =</tt>
</p>

</div>

<div class="outline-3">
<h3 id="sec-28">7.4 Change indentation of a table</h3>

<p><b>How can I change the indentation of an entire table without fixing every line by hand?</b>
</p>
<p>
The indentation of a table is set by the first line.  So just fix the
indentation of the first line and realign with <code>TAB</code>.
</p>
</div>

<div class="outline-3">
<h3 id="sec-29">7.5 Performance issues with table alignment</h3>

<p><b>I have a huge table in a file, and the automatic realign of tables  is just taking too long.  What can I do?</b>
</p>
<p>
Either split the table into several by inserting an empty line every
100 lines or so.  Or turn off the automatic re-align with
</p>
<p>
<pre>
 (setq org-table-automatic-realign nil)
</pre>
</p>
<p>
After this the only way to realign a table is to press <code>C-c C-c</code>.  It
will no longer happen automatically, removing the corresponding delays
during editing.
</p>
</div>

<div class="outline-3">
<h3 id="sec-30">7.6 Performance issues with table calculation</h3>

<p><b>I have a complex table with lots of formulas, and recomputing the  table takes rather long.  What can I do?</b>
</p>
<p>
Nothing, really.  The spreadsheet in org is mostly done to make
calculations possible, not so much to make them fast.  Since Org-mode
is firmly committed to the ASCII format, nothing is stopping you from
editing the table by hand.  Therefore, there is no internal
representation of the data.  Each time Org-mode starts a computation,
it must scan the table for special lines, find the fields etc.  This
is slow.  Furthermore, Calc is slow compared to hardware computations.
To make this work with normal editing, recalculation is not happening
automatically, or only for the current line, so that the long wait for
a full table iteration only happens when you ask for it.
</p>
<p>
So for really complex tables, moving to a "real" spreadsheet may still
be the best option.
</p>
<p>
That said, there are some ways to optimize things in Org-mode, and I
have been thinking about moving a bit further down this line.
However, for my applications this has so far not been an issue at all.
If you have a good case,you could try to convince me.
</p>
</div>

<div class="outline-3">
<h3 id="sec-31">7.7 Incrementing numbers</h3>

<p>*When I press <code>S-RET</code> in a table field to copy its value down, the
content is not copied as is, but it is increased by one.
Is that a bug or a feature*
</p>
<p>
Well, it is <i>supposed</i> to be a feature, to make it easy to create a
column with increasing numbers.  If this gets into your way, turn it
off with
</p>
<p>
<pre>
 (setq org-org-table-copy-increment nil)
</pre>
</p>
</div>
</div>
