ORGWEBPAGE/faq.org
** Include Org-mode agenda into Emacs diary
 *Is it possible to include entries from org-mode files into my emacs
diary?* 

Since the org-mode agenda is much more powerful and can contain the
diary, you should think twice before deciding to do this.  If you
insist, however, integrating Org-mode information into the diary is
possible.  You need to turn on /fancy diary display/ by setting in
.emacs:

: (add-hook 'diary-display-hook 'fancy-diary-display)

Then include the following line into your ~/diary file, in
order to get the entries from all files listed in the variable
=org-agenda-files=

: &%%(org-diary)
You may also select specific files with

: &%%(org-diary) ~/path/to/some/org-file.org
: &%%(org-diary) ~/path/to/another/org-file.org

If you now launch the calendar and press @<tt>d@</tt> to display a diary, the
headlines of entries containing a timestamp, date range, schedule, or
deadline referring to the selected date will be listed.  Just like
Org-mode's agenda view, the diary for /today/ contains additional
entries for overdue deadlines and scheduled items.  See also the
documentation of the =org-diary= function.  Under XEmacs, it is
not possible to jump back from the diary to the org, this works only in
the agenda buffer.

* COMMENT HTML style specifications

# Local Variables: 
# org-export-html-style: "<link rel=stylesheet href=\"freeshell2.css\" type=\"text/css\"> <style type=\"text/css\"> .tag { color: red; font-weight:bold}</style>" 
# End:
