ORGWEBPAGE/tmp/faq.html

<div class="outline-2">
<h2 id="sec-32">8 Agenda</h2>


<div class="outline-3">
<h3 id="sec-33">8.1 Include Org-mode agenda into Emacs diary</h3>

<p><b>Is it possible to include entries from org-mode files into my emacs diary?</b> 
</p>
<p>
Since the org-mode agenda is much more powerful and can contain the
diary, you should think twice before deciding to do this.  If you
insist, however, integrating Org-mode information into the diary is
possible.  You need to turn on <i>fancy diary display</i> by setting in
.emacs:
</p>
<p>
<pre>
 (add-hook 'diary-display-hook 'fancy-diary-display)
</pre>
</p>
<p>
Then include the following line into your ~/diary file, in
order to get the entries from all files listed in the variable
<code>org-agenda-files</code>
</p>
<p>
<pre>
 &amp;%%(org-diary)
</pre>
You may also select specific files with
</p>
<p>
<pre>
 &amp;%%(org-diary) ~/path/to/some/org-file.org
 &amp;%%(org-diary) ~/path/to/another/org-file.org
</pre>
</p>
<p>
If you now launch the calendar and press <tt>d</tt> to display a diary, the
headlines of entries containing a timestamp, date range, schedule, or
deadline referring to the selected date will be listed.  Just like
Org-mode's agenda view, the diary for <i>today</i> contains additional
entries for overdue deadlines and scheduled items.  See also the
documentation of the <code>org-diary</code> function.  Under XEmacs, it is
not possible to jump back from the diary to the org, this works only in
the agenda buffer.
</p>

</div>
</div>
<div id="postamble"><p class="author"> Author: Carsten Dominik
<a href="mailto:carsten.dominik@gmail.com">&lt;carsten.dominik@gmail.com&gt;</a>
</p>
<p class="date"> Date: 2008/01/27 10:12:10</p>
</div></body>
</html>
